In [1]:
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html
import pandas as pd
import numpy as np
from datetime import datetime, date

In [77]:
pd.DataFrame([1,2,3], index=['a','b','c'])

   0
a  1
b  2
c  3

In [80]:
pd.DataFrame([1,2,3])

   0
0  1
1  2
2  3

In [3]:
pd.DataFrame([[1,2],[3,4],[5,6]])

   0  1
0  1  2
1  3  4
2  5  6

In [5]:
pd.DataFrame([[1,2,3],[4,5,6]]).T

   0  1
0  1  4
1  2  5
2  3  6

In [78]:
pd.DataFrame([[1,2,3]], index=['a','b','c'])

   0  1  2
a  1  2  3
b  1  2  3
c  1  2  3

In [79]:
pd.DataFrame([[1,2,3]])

   0  1  2
0  1  2  3

In [17]:
pd.DataFrame(np.array([[100, 200, 300]]), columns=['a', 'b', 'c'])

     a    b    c
0  100  200  300

In [1]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])

# COLUMNS
df.columns

# INDEX
df.index
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
# sort by col value, and get the row containing the max 
df.loc[df.sort_values(by=['a'], ascending=False).a.idxmax()]

a    7
b    8
c    9
Name: 2, dtype: int32

In [5]:
# select columns
df.loc[:, ['a','b']]

   a  b
0  1  2
1  4  5
2  7  8

In [6]:
# select/filter rows by col value
df.loc[(df['a'] > 3) & (df['b'] < 8)]

   a  b  c
1  4  5  6

In [10]:
# replace a column with booleans
df['b'] = [True, False, False]

   a      b  c
0  1   True  3
1  4  False  6
2  7  False  9

In [21]:
# replace a column with booleans based on a condition
df['a'] = (df['c'] > 3) # & (df['b'] == True)
df

       a      b  c
0  False   True  3
1   True  False  6
2   True  False  9

In [8]:
# turn df into array [rowname, colname, value] - ready for 3D bar plotting
arr = []
for label, content in df.items():
    arr.append([label, content])
    
# type(arr[0][1]) # pandas.core.series.Series
a = arr[0]

[['a',
  0    1
  1    4
  2    7
  Name: a, dtype: int32],
 ['b',
  0    2
  1    5
  2    8
  Name: b, dtype: int32],
 ['c',
  0    3
  1    6
  2    9
  Name: c, dtype: int32]]

In [22]:
for i in df.index:
    print(i)

0
1
2

In [24]:
for c in df.columns:
    print(c)

a
b
c

In [16]:
# run a function on a column
def my_fun(x): return x ** 2

df['a'].apply(lambda x: my_fun(x))

0     1
1    16
2    49
Name: a, dtype: int64

In [44]:
def prepare_xyz(df):
    arr = []

    for day in df.index:
        for exp in df.columns:
            bar = [exp, day, df.loc[day, exp]]
            arr.append(bar)
    #         print(bar)
    x = [] 
    y = [] 
    z = []

    for bar in arr:
        exp, day, strike = bar
        x.append(exp)
        y.append(day)
        z.append(strike)
        
    return x, y, z

prepare_xyz(df)

(['a', 'b', 'c', 'a', 'b', 'c', 'a', 'b', 'c'],
 [0, 0, 0, 1, 1, 1, 2, 2, 2],
 [1, 2, 3, 4, 5, 6, 7, 8, 9])

In [50]:
# save to csv
win_filename = 'D:\\code\\test.csv'
df.to_csv(win_filename)
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [55]:
# read from csv
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
pd.read_csv(win_filename, index_col=0)

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [56]:
# concatenate dfs
df2 = pd.DataFrame(np.arange(9).reshape(3,3), columns=['a','b','c'])
pd.concat([df, df2], axis=0, ignore_index=True)

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9
0  0  1  2
1  3  4  5
2  6  7  8

In [60]:
# concatenate unmatching dfs - missing column names
df2 = pd.DataFrame(np.arange(9).reshape(3,3))
newdf = pd.concat([df, df2], axis=0, ignore_index=True)

newdf

     a    b    c    0    1    2
0  1.0  2.0  3.0  NaN  NaN  NaN
1  4.0  5.0  6.0  NaN  NaN  NaN
2  7.0  8.0  9.0  NaN  NaN  NaN
3  NaN  NaN  NaN  0.0  1.0  2.0
4  NaN  NaN  NaN  3.0  4.0  5.0
5  NaN  NaN  NaN  6.0  7.0  8.0

In [62]:
# concatenate unmatching dfs - diff column names
df3 = pd.DataFrame(np.arange(9).reshape(3,3), columns=['d', 'e', 'f'])
newdf = pd.concat([df, df3], axis=0, ignore_index=True)

newdf

     a    b    c   d    e    f
0  1.0  2.0  3.0  10  NaN  NaN
1  4.0  5.0  6.0  11  NaN  NaN
2  7.0  8.0  9.0  12  NaN  NaN
3  NaN  NaN  NaN   0  1.0  2.0
4  NaN  NaN  NaN   3  4.0  5.0
5  NaN  NaN  NaN   6  7.0  8.0

In [61]:
df['d'] = [10, 11, 12]
df

   a  b  c   d
0  1  2  3  10
1  4  5  6  11
2  7  8  9  12

In [8]:
# shift
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shift.html
df[df['a'].shift(1) <= 4]['a'] # Arousi's strategy https://github.com/ranaroussi/futuresio-webinars/blob/master/01-prototyping-trading-strategies.ipynb

1    4
2    7
Name: a, dtype: int64

In [18]:
# dropna
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html?highlight=dropna#pandas.DataFrame.dropna
df['d'] = [np.nan, 11, 12]
df['e'] = [13, 14, pd.NaT]
df.dropna() # df.dropna(inplace=False, axis=0, thresh=0, how='any')
# df.dropna(inplace=True) # overwrites df

df.dropna(subset=['a', 'e']) # look in these columns

df.dropna(thresh=2) # need at least 2 nans

df.dropna(how='all') # drops row only if all vals are nans. 'any' - default

df.dropna(axis=1) # 0 = index = drops rows; 1 = drops columns

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
# df.drop
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html
df.drop(['a', 'c'], axis=1)

   b     d    e
0  2   NaN   13
1  5  11.0   14
2  8  12.0  NaT

In [23]:
# show rows were col d is not nan 
df.loc[~np.isnan(df['d'])]

   a  b  c     d    e
1  4  5  6  11.0   14
2  7  8  9  12.0  NaT

In [6]:
# add datetime column
df['dates'] = [
    date(2020,1,1),
    date(2020,1,2),
    date(2020,1,3),
]
type(df['dates'][0])

datetime.date

In [20]:
# select rows by date column
df[df['dates'] == date(2020,1,2)]

   a  b  c       dates
1  4  5  6  2020-01-02

In [9]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [24]:
# Need to scale 2 dfs for plotting. reindex?

# append a new row
df2 = pd.concat([df, pd.DataFrame(np.array([[100, 200, 300]]), columns=['a', 'b', 'c'])], axis=0, ignore_index=True)

# place it in the middle
b, c = df2.iloc[1].copy(), df2.iloc[3].copy()
df2.iloc[3],df2.iloc[1] = b,c

df2

     a    b    c
0    1    2    3
1  100  200  300
2    7    8    9
3    4    5    6

In [25]:
df2['key'] = ['a0', 'a1', 'a2', 'a3']
df2

     a    b    c key
0    1    2    3  a0
1  100  200  300  a1
2    7    8    9  a2
3    4    5    6  a3

In [28]:
df['key'] = ['a0', 'a3', 'a2']
df

   a  b  c key
0  1  2  3  a0
1  4  5  6  a3
2  7  8  9  a2

In [30]:
# goal now is to add a1 missing key to df and set it to NaN
df2['key'].isin(df['key'])

0     True
1    False
2     True
3     True
Name: key, dtype: bool

In [32]:
# try index
# https://pandas.pydata.org/pandas-docs/dev/reference/api/pandas.Index.union.html?highlight=union#pandas.Index.union
idx1 = pd.Index(df['key'])
idx2 = pd.Index(df2['key'])
idx3 = idx1.union(idx2)
# idx3  # Index(['a0', 'a1', 'a2', 'a3'], dtype='object', name='key')

Index(['a0', 'a1', 'a2', 'a3'], dtype='object', name='key')

In [55]:
df3 = pd.DataFrame([], columns=['df', 'df2'], index=idx3)
df3 # ok!

      df  df2
key
a0   NaN  NaN
a1   NaN  NaN
a2   NaN  NaN
a3   NaN  NaN

In [59]:
# extract values as array https://pandas.pydata.org/pandas-docs/dev/reference/api/pandas.DataFrame.values.html
values = df[['key', 'a']].values
values

array([['a0', 1],
       ['a3', 4],
       ['a2', 7]], dtype=object)

In [62]:
# iterate over it
for key, val in values:
    # print(key, val)
    # assign val at key to df3
    df3.loc[key, 'df'] = val
    
df3

      df  df2
key
a0     1  NaN
a1   NaN  NaN
a2     7  NaN
a3     4  NaN

In [67]:
for key in ['a0', 'a1', 'a2', 'a3']:
    # print(type(df3.loc[key]))
    print(df3.loc[key]['df'])

1
nan
7
4

In [81]:
df4 = pd.DataFrame([1,2,3], index=['a','b','c'])
df4

   0
a  1
b  2
c  3

In [83]:
df5 = pd.DataFrame([4,5,6,7], index=['b','c', 'd', 'e'])
df5

   0
b  4
c  5
d  6
e  7

In [95]:
for key in df5.index:
    #print(key)
    print(df5.loc[key][0])

4
5
6
7

In [103]:
def even_columns(df1, df2, df1col=0, df2col=0):
    # values must be [key, val]
    
    # merge indeces 
    index = df1.index.union(df2.index)
    
    # make output df
    df3 = pd.DataFrame([], columns=['df1', 'df2'], index=index)
    
    # work df1
    for key in df1.index:
        df3.loc[key]['df1'] = df1.loc[key][df1col]
        
    # work df2
    for key in df2.index:
        df3.loc[key]['df2'] = df2.loc[key][df2col]
        
    return df3

In [104]:
r = even_columns(df4, df5)
print(r)

   df1  df2
a    1  NaN
b    2    4
c    3    5
d  NaN    6
e  NaN    7

In [109]:
df6 = pd.DataFrame([])
df6['a'] = df4[0]
df6

   a
a  1
b  2
c  3

In [114]:
# https://pandas.pydata.org/pandas-docs/dev/reference/api/pandas.DataFrame.combine_first.html
# works as well, but columns must be named differently
df6.combine_first(df5)

     a    0
a  1.0  NaN
b  2.0  4.0
c  3.0  5.0
d  NaN  6.0
e  NaN  7.0